## Final Project Submission

Details:
* Student name: Kelvin Kitonga Nzomo
* Student pace:  full time
* Scheduled project review date/time: 23/05/2022 10:00 AM
* Instructor name: Antonny Muiko

In [45]:
#start with importation of python libraries that will be needed during data cleaning, data analysis and data visualization
import pandas as pd
import csv
import numpy
import matplotlib as plt

## DATA ANALYSIS ROAD MAP
Checklist that was followed for this analysis:

        1. Data exploration
        2. Data Cleaning
        3. Data aggregation
        4. Data Visualization
        5. Conclusion
        6. Recommendations

In [46]:
# load the datasets that will be need in this analysis. I shall use aliasing to faciliate easier analyses.
# the three data sets that shall be used include: bom.movie_gross.csv, title.basics.csv and title.ratings.csv
# it was observed that all the three data files share common columns which can be used in joining them.

#load the data in data frames:

movie_gross_df = pd.read_csv('datasets/bom.movie_gross.csv')

title_basics_df = pd.read_csv('datasets/title.basics.csv')

title_ratings_df = pd.read_csv('datasets/title.ratings.csv')

# EXPLORATION OF THE DATA SETS


The data shall be explored by determining the below so that we can have a better understanding of our data:
1. The first two rows of the data frame
2. The shape of the dataframe
3. The data types of the dataframes

### i. Explore Movie Gross Dataset

In [60]:
# print out first 4 records in the dataframe
movie_gross_df.head()

,title,studio,domestic_gross,foreign_gross,year
0,Toy Story 3,BV,415000000.0,652000000,2010
1,Alice in Wonderland (2010),BV,334200000.0,691300000,2010
2,Harry Potter and the Deathly Hallows Part 1,WB,296000000.0,664300000,2010
3,Inception,WB,292600000.0,535700000,2010
4,Shrek Forever After,P/DW,238700000.0,513900000,2010

In [61]:
#print out the number of columns and rows in the dataset
movie_gross_df.shape

(3387, 5)

In [62]:
# print out information on various parameters of data in the dataframe
movie_gross_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3387 entries, 0 to 3386
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   title           3387 non-null   object
 1   studio          3382 non-null   object
 2   domestic_gross  3359 non-null   float64
 3   foreign_gross   2037 non-null   object
 4   year            3387 non-null   int64
dtypes: float64(1), int64(1), object(3)
memory usage: 132.4+ KB

#### Observations
We note that the data the in movie gross datasets contains finacial information regarding various movies and their respective years. 
The data set has 5 columns and 3387 rows.There are 3386 movie records. 

The columns in the dataset include title, studio, domestic gross, foreign gross and year. 

The most of the data types are inline with our expectations except the foreign gross column whose records are indicated as onjects instead of float as in the type of data contained in column domestic gross.

Also there are missing data in the following columns: studio, domestic_gross and foreign_gross.

## ii. Explore Title Basics Dataset

In [63]:
# print out first 4 records in the dataframe
title_basics_df.head()

,tconst,primary_title,original_title,start_year,runtime_minutes,genres
0,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama"
1,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.0,"Biography,Drama"
2,tt0069049,The Other Side of the Wind,The Other Side of the Wind,2018,122.0,Drama
3,tt0069204,Sabse Bada Sukh,Sabse Bada Sukh,2018,NaN,"Comedy,Drama"
4,tt0100275,The Wandering Soap Opera,La Telenovela Errante,2017,80.0,"Comedy,Drama,Fantasy"

In [64]:
#print out the number of columns and rows in the dataset
title_basics_df.shape

(146144, 6)

In [65]:
# print out information on various parameters of data in the dataframe
title_basics_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 146144 entries, 0 to 146143
Data columns (total 6 columns):
 #   Column           Non-Null Count   Dtype
---  ------           --------------   -----
 0   tconst           146144 non-null  object
 1   primary_title    146144 non-null  object
 2   original_title   146123 non-null  object
 3   start_year       146144 non-null  int64
 4   runtime_minutes  114405 non-null  float64
 5   genres           140736 non-null  object
dtypes: float64(1), int64(1), object(4)
memory usage: 6.7+ MB

### Observations

This dataset has 6 columns which include: tconst, primary_title, original_title, start_year, runtime_minutes and genres.
The dataset is focused on information regarding films in different genres that that were released in different years.

The dataset is composed of 146,144 records and information on 146,143 films. 

The data types are as they should be expected with columns containing string classified as objects while numerical values for year and runtime_minutes as float and integers respectively.
The columns with missing data in this data set include original_title, runtime_minutes and genres.

this data set has fields that are common with the other two datasets:

    a) The movie gross datasets has a title column that may be shared with either of the two title columns
    b) The tconst field is similar to the tconst column that is contained in the title ratings dataset.

## iii. Explore Title Ratings Dataset

In [72]:
# print out first 4 records in the dataframe
title_ratings_df .head()

       tconst  averagerating  numvotes
0  tt10356526            8.3        31
1  tt10384606            8.9       559
2   tt1042974            6.4        20
3   tt1043726            4.2     50352
4   tt1060240            6.5        21

In [73]:
#print out the number of columns and rows in the dataset
title_ratings_df.shape

(73856, 3)

In [74]:
# print out information on various parameters of data in the dataframe
title_ratings_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 73856 entries, 0 to 73855
Data columns (total 3 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   tconst         73856 non-null  object
 1   averagerating  73856 non-null  float64
 2   numvotes       73856 non-null  int64
dtypes: float64(1), int64(1), object(1)
memory usage: 1.7+ MB

### Observations

This dataset contains data regarding the ratings on various films which are identified by the index colum which is tconst. 

This dataset has three columns including tconst, averageratings and numvotes.
The tconst column is common to this dataset and the title_basics dataset.

## Explore Data Ratings